module {
  func.func @main(%arg0: tensor<10x784xf32>) -> tensor<10x10xf32> {
    %cst = stablehlo.constant dense_resource<torch_tensor_10_torch.float32> : tensor<10xf32>
    %cst_0 = stablehlo.constant dense_resource<torch_tensor_10_128_torch.float32> : tensor<10x128xf32>
    %cst_1 = stablehlo.constant dense_resource<torch_tensor_128_torch.float32> : tensor<128xf32>
    %cst_2 = stablehlo.constant dense_resource<torch_tensor_128_784_torch.float32> : tensor<128x784xf32>
    %cst_3 = stablehlo.constant dense<0.000000e+00> : tensor<10x128xf32>
    %cst_4 = stablehlo.constant dense<0xFF800000> : tensor<f32>
    %cst_5 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %ones_i64 = arith.constant dense<1> : tensor<1xi64>
  
    %0 = stablehlo.transpose %cst_2, dims = [1, 0] : (tensor<128x784xf32>) -> tensor<784x128xf32>
    %1 = stablehlo.dot_general %arg0, %0, contracting_dims = [1] x [0] : (tensor<10x784xf32>, tensor<784x128xf32>) -> tensor<10x128xf32>
    %2 = stablehlo.convert %ones_i64 : (tensor<1xi64>) -> tensor<1xf32>
    %ones_f32 = stablehlo.reshape %2 : (tensor<1xf32>) -> tensor<f32>
    %4 = stablehlo.broadcast_in_dim %1, dims = [0, 1] : (tensor<10x128xf32>) -> tensor<10x128xf32>
    %5 = stablehlo.broadcast_in_dim %ones_f32, dims = [] : (tensor<f32>) -> tensor<10x128xf32>
    %6 = stablehlo.multiply %4, %5 : tensor<10x128xf32>
    %7 = stablehlo.broadcast_in_dim %ones_f32, dims = [] : (tensor<f32>) -> tensor<128xf32>
    %8 = stablehlo.broadcast_in_dim %cst_1, dims = [0] : (tensor<128xf32>) -> tensor<128xf32>
    %9 = stablehlo.multiply %7, %8 : tensor<128xf32>
    %10 = stablehlo.broadcast_in_dim %6, dims = [0, 1] : (tensor<10x128xf32>) -> tensor<10x128xf32>
    %11 = stablehlo.broadcast_in_dim %9, dims = [1] : (tensor<128xf32>) -> tensor<10x128xf32>
    %12 = stablehlo.add %10, %11 : tensor<10x128xf32>
    %13 = stablehlo.maximum %12, %cst_3 : tensor<10x128xf32>

    %14 = stablehlo.transpose %cst_0, dims = [1, 0] : (tensor<10x128xf32>) -> tensor<128x10xf32>
    %15 = stablehlo.dot_general %13, %14, contracting_dims = [1] x [0] : (tensor<10x128xf32>, tensor<128x10xf32>) -> tensor<10x10xf32>

    %16 = stablehlo.broadcast_in_dim %15, dims = [0, 1] : (tensor<10x10xf32>) -> tensor<10x10xf32>
    %17 = stablehlo.broadcast_in_dim %ones_f32, dims = [] : (tensor<f32>) -> tensor<10x10xf32>
    %18 = stablehlo.multiply %16, %17 : tensor<10x10xf32>
    %19 = stablehlo.broadcast_in_dim %ones_f32, dims = [] : (tensor<f32>) -> tensor<10xf32>
    %20 = stablehlo.broadcast_in_dim %cst, dims = [0] : (tensor<10xf32>) -> tensor<10xf32>
    %21 = stablehlo.multiply %19, %20 : tensor<10xf32>
    %22 = stablehlo.broadcast_in_dim %18, dims = [0, 1] : (tensor<10x10xf32>) -> tensor<10x10xf32>
    %23 = stablehlo.broadcast_in_dim %21, dims = [1] : (tensor<10xf32>) -> tensor<10x10xf32>
    %24 = stablehlo.add %22, %23 : tensor<10x10xf32>
  
    %25 = stablehlo.reduce(%24 init: %cst_4) applies stablehlo.maximum across dimensions = [1] : (tensor<10x10xf32>, tensor<f32>) -> tensor<10xf32>
    %26 = stablehlo.reshape %25 : (tensor<10xf32>) -> tensor<10x1xf32>
    %27 = stablehlo.broadcast_in_dim %24, dims = [0, 1] : (tensor<10x10xf32>) -> tensor<10x10xf32>
    %28 = stablehlo.broadcast_in_dim %26, dims = [0, 1] : (tensor<10x1xf32>) -> tensor<10x10xf32>
    %29 = stablehlo.subtract %27, %28 : tensor<10x10xf32>
    %30 = stablehlo.exponential %29 : tensor<10x10xf32>
    %31 = stablehlo.reduce(%30 init: %cst_5) applies stablehlo.add across dimensions = [1] : (tensor<10x10xf32>, tensor<f32>) -> tensor<10xf32>
    %32 = stablehlo.reshape %31 : (tensor<10xf32>) -> tensor<10x1xf32>
    %33 = stablehlo.broadcast_in_dim %30, dims = [0, 1] : (tensor<10x10xf32>) -> tensor<10x10xf32>
    %34 = stablehlo.broadcast_in_dim %32, dims = [0, 1] : (tensor<10x1xf32>) -> tensor<10x10xf32>
    %35 = stablehlo.divide %33, %34 : tensor<10x10xf32>
    return %35 : tensor<10x10xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_10_torch.float32: "0x04000000888E913D16868F3CD5019A3D5BE133BC6B81BE3BB128783D272DF73CCC85263D900188BDC17DCA3C",
      torch_tensor_10_128_torch.float32: "0x0400000023168F3D4D7B243D2211883DCC397E3CD9189B3D0B9698BDBD5E5B3DC7BEA8BDCBCBBBBC031599BDE39410BD1F02353DE9D137BCA001763D103E9F3D2F05563DEFD68F3DDB035D3C5C3975BD0F0935BD30D2333D5D07E23C29FA37BD9072C83B2A65973C0F25933DE1AFB23D3DF9B33D5B4932BD6F92F53CC72D7A3D65D8CABC53E023BDD91F08BD55B38CBCBE2920BD8FB57FBDFC5F36BDFA85F4BCEC959D3CE283F73CBA0B973D2318A5BD2602A33C12814EBB2BD656BDBDCA873D9E158EBDC83D2B3DA37797BDB8488B3D63FEA6BD264A843C9962A2BD0875883D6FA4203DC7621FBD4882A83DF3B902B997566DBCF1B2F03C1335873C6E9D0B3D8C62A5BCB596B3BD88ED05BD3B57883CD461323D9FA08B3C5BF8033DE825A23DB0260CBD5E07C4BA9A7D2CBDED557EBD2F62733CD6B48EBD8E0C81BD05099BBCD7F2B33D7E9D973DBB93823DDFCA953DD1C079BCD9087F3DDB4A80BD0CB06C3D2DD2873D2FB64B3D4C439EBC1FFEB43DB01A8BBD286DEC3C70CE773DB8616F3C90417C3D5C147F3DBB0E853DE8499C3D7906AD3C13379E3C8DD6A63D2B97FCBC7863A4BD9BF7143D00A421BDC7854CBD12B1553DDD2E293C83B85F3DE110983DD737823B6970853DF65C8F3B971FA63C6337E13C529E5C3D7C13273DD0CE8F3D4422F1BCE694663DB60B13BBE3DE5E3D93EABF3BA19C5E3D40AFB53C1D5D873D9E40103D50FB9C3DAE4F70BD8216ABBDADE3B0BD5D7B013DF8987A3ACE28AEBC3E55973DD61798BD56EBEB3C58F677BD622593BD09BEA4BDAFAB80BC2161693D9076A3BDE24C403D023FB43DA67FD8BC1466823DFE72613D16189E3DAFB6773D8F0E44BDB4FD18BD7C66C6BCDAB7DE3CCBC281BDD18C783D0AFBA53D2647963D092014BD57A7DBBB8AE3663C47A22FBD12A8743C88C571BDF87F4BBDB33F69BDB6BAAA3D8059403C8C7956BD05943D3DDBBCA6BA185858BC3FA6593C55CA0BBD001EC33CAA2FA83D76D894BDFE5462BC8B4B843C2F5F3FB9F489CA3CFFD91ABC9DC9393D21F549BC4D437EBDF7DDA63D8DC78C3B3A21993D9DF64A3D6347923DDE021FBD01E5BB3CCC17883D97C19D3D731E70BD77807CBD8409D4BCE606EBBC5D6E0FBD7A70DA3A901F893C707285BDCA7B37BD2287223C76FBACBD31ACD0BCB06E6BBC0F1245BDEFE3AFBD70EA96BDFD665EBD770703BC2A31DFBC6A658A3D8EA66E3DF584AEBDA752313D28CDAEBDE18C89BC69766B3D4AC5A43D6F2BBFBCB9A2E33C1DA9C1BCE2F5513D8A3F1EBD26A10ABDFF3554BC562B173C683D07BD09D9093D17F89EBDE25494BD69C6133D618520BD0CA0B13D8FF6DF3C24A2D4BB446B0CBD9E055C3DD155AA3DA6803B3D11589F3DF28A85BD1D6A8A3D76875A3981D1503DF14C9CBC6166083DE45889BD0204013D8B8808BD8A697CBDD8C66FBD707B86BCEF044D3D41414ABDE656543D2DC308BD717E673D362559BD614347BDC0E382BD4BA7BABC3B86AE3D278147BD36B0553CE941123DE2B33B3DF6C9A53D89D06BBBBA7E703B4B66C53CAB311FBDB5C05DBD4BBE87BD18273F3D0A250E3DAAAD34BDE38E4DBCE8717D3CFD2233BD81F600BC4016F03C62743C3D63926B3D876283BD0BD5453DD232AEBD4DCF07BD846184BDD9C7CABC5688CF3CBD9063BD69826DBD08BC94BD50C48FBD8C4F6CBC4E01393BA00A7FBDB49699BD9D9EBD3B1185353DCA5A8A3D58CEAABD9F16C33CA753973D46C5223DE15C9EBDB5E478BD51AED43C6CA95C3D4E22D9BC993B9CBD1DF8A7BC397CACBD4AA9953D6366A33D336A203C33F5B03D7869A43A5A6B583DF87A873D698B873CD98F733D79CDB23C7B2FF1BC8AA333BD818B123DC890D2BCE8E0113DE89490BDFEABA2BC5CFD903DEA2B1A3C1D8BA7BDE4C812BBE7B2063CD39A97BD4811983D9DF6C83AC3D9973D09649A3D82395B3DE9B78F3D2890A63D82A0DC3A440B2B3D1E9D96B8E400A33C16316E3CE7A5983A9316ABBD1C073ABB0A29EFBC03601E3DA4CB253D49E70A3DB2E08EBD234270BDF60065BDF540953B077DE73BEAF1B6BCA9E3213C4E958E3D8EDD053DA5540F3DA5625C3DB55E0B3C033A7B3C0B4E683D1170A7BDA28391BD35DD843DBCD412BDD38B71BC3C9BAB3D92DA9ABCC3A180BDEC14D3BB1EFBA23D2523093A573293BDA499863D47997E3DBDF3AA3DA58700BDB64E3DBC00304FBDBFD9A8BD9803B33D6F048C3D2D3030BD79F84E3D6155973D2BFF7E3C5F9A973CC6598C3C4AAE5DBDF2548F3DEF5643BD573E563C27E901BD0568893C313483BCCCFB17BD1679B3BD8D1BFD3BDF4393BD377896BD59D0943DC4F36B3DDDFA94BBF2890EBDFB83603DF364593D020896BC387040BDDB1E01BDE777DA3A591F7EBD4B20863DA36FAF3DBF32C83B773F67BCB20AA2BDB9170D3D23D7DBBCFE82A0BD9DB140BD01DC4D3CF190C9BCD23E2F3DCB796FBDBC60F1BC0B0C463C890392BDE8879ABDE7D17EBD6E8D93BD23E281BD6FC400BBBF8382BCCDFD36BD715C85BDA574623DF4B3A53B3B787ABDFCE1ADBDB743373D1378393DB30EB83CF5EB063D4391713D756CC9BCD2E8E23C1902B3BDF16797BD47A356BD268CAABD8CF56FBB279DB1BC3258A7BCA91F803D55A3843D753923BDF605773D118148BD1F79513C92EEA43D381E963DEB5A31BD6B016FBD1A24F9BCFDC088BDD39DA1BD4AA732BD422423BDAB0191BC3B75E23C0A4138BD57F7A8BD00357A3C5FBFA33D6A48283D3731A63D016A563DA8A8483DF7B270BCDC8DAD3D98258EBD44208E3C7C9955BDA63555BDB49CCCBA4F51C3BC7901F13CEEE6E93C061E04BD392133BD66668F3D5A557A3D42D9B13CBF37643DB98F13BCD19194BD5766313D9C1BA2BC912E573D0ACE1DBD12F3D23B6BAA92BC882F8E3D7DB263BD93E215BCD46C503D946C983DF96F123A752956BDCD4F7F3D2084A6BD1CA9B43D1927A7BD2A0F303D06B99DBDD4DE7CBC2D30303D8F648C3DF647D03C82B21C3DCD3EC1BC25284FBD320601BDF6205A3D5884583D9BD56D3D0BD56DBD50BA003CCBAB09BD2F6B43BCE009463DAB33123DA40B733DEE40A73C51CE23BD70B66FBDCF495A3CB9B586BD5FBB37BCDDC263BDD0333A3D966D49BC754026BD82DE99BCE17978BD7AE39EBD7DC35E3D55E5683D156F4E3C8128C6BCD1B98FBCA1DABDBB603A01BDB4A67CBB6383A8BD4470113D89B1C43C2B60063C270349BDB861253D2119A6BDD6DD0CBDEA5915BDF40DC4BCA4EEE53CD744A4BD9AA58CBDFD123ABDA2E5B53BD767EF3CD5080EBD0E6138BCECBCB23DE1BE233D172576BDE94A83BDE385243D36C59FBD754D903D64F9A73D254F3F3C4367583DD6A6933C7DD7993D0E32B43D99EDB7BC78D3F4BCCAEF2A3D4DBB3A3D0900993DCFEC083DE4A2AE3DFD0491BD03EB993DC937AABD16E10EBCED188FBDABEDAA3DE55C35BD8DCB453DCC271C3D9BAA903C6030043D5936A9BD8D5BAC3DBD80CEBC02339D3DFA9152BC264916BD28285C3D28E7993DAAEBB1BB8729853D8EA47DBD63CF81BC05EFA5BD475F5C3B0CCE653B51D163BD75732FBD762619BDC6E1A7BD801D7C3D980CA23DDDF0923D94DB1C3C883EA5BC811098BC4139B2BDB05213BD769B68BD0D8D6DBD0E378DBDBDB094BD8CB0943D0A5015BD1F0481BD334A943DEBBB0E3D69A339BBC6A14E3DEEDB42BD7F1D16BD4F1DF73CCCCD123D5AB511BD484325BD68820D3C05D3563D6980693DFFBEE1BC3881D33C3884B7BC6B1A63BD196494BCC470D63CAA286D3DBE5C743D3B82E13CC3BC86BDD33AABBD59C3EABC798B4F3BC58736BDE35C43BD31779CBDE7CB4EBDD5D5AFBD0AA3403C4EA8FEBC216988BC6E6197BD0D3C00BDF4A3603D9BC756BDDF144EBDF8DB6D3BDBFE703D57B01B3DD0EEB23DE8CE133D8393B23B5A8975BDD1109EBDAD94ABBB9D9207BC862D303D667340BC6954C6BC8FB6F13A64660EBDD9858E3C73D5A6BCC9C58CBCDF07B0BCF0B234BD369D54BD18EC013C9987053D42BEEB3C1809D43CA286A13BD659A4BDDE7F7C3D47B6333D563D14BD0A4C58BD0CFEE8BC65049C3C23D25CBC76973E3D747F4FBB542EA4BDF7D35F3D46E6CA3C01BB123D3254D13C244273BDFABE263CBD3955BDA0F4783D7D4422BD568791BAD353883DD3B7A03C39F6BE3C6EEE50BDF8BF11BD4991883D87BFA6BDFB75CDBCA2F84FBC8738C9BCF298613B8E6B9A3CFFEA9B3DFF35503DE07EBA3BEB0FD53C1CF73EBDC50D50BD6530F4BBF021253C757879BD6E9CAD3D99D661BCE968F1BC9548AC3DC5F5B3BDC65A203D01AD903D692BFA3C3A6770BD65681EBB68C763BD4881A83D4A4F0CBD737091BD043DD1BBBB027C3D6F5215BD3B90AE3D972C723D6DDABABC59C29F3D551DE6BBC148913A865219BD5A6EB3BD2BE7443C3E4EA9BC4A0FB43DBAF5813A8BB4B0BD3874843D0B1D2FBDF3D45D3DE572A43DBB3A83BC6C9356BD89A78D3DBBC420BD0628AA3D47978FBC5330D3BCE477153D95DC95BD493C8D3D51548C3DD7116CBD083B05BD805E2E3CBA60AFBC15AD4BBD06475A3C3B58D3BCB040AEBDC632623D2DF88DBD619E9C3D0C0996BC8C5C983DA01D8CBCAAA8073B2C209C3D678F7C3D31E8A73D377F37BDDFA3C6BC6029B4BDC58B1D3D8C75E9BC22F95FBDA7AF5CBD316B073D7CCB87BDC1EFAB3DB2FBEA3CCD7F823D4FFBACBD78275E3D072D6BBD320B15BD07BE543D6C1430BC10DC7DBA6CBFD33B3581A93D0F251BBD9A38003DF45A5FBB25688B3D2F5AA73B4A3591BCB80B40BB37A9E03C63CC9EBC42E8A43D4F7669BDB4138D3D84DD823D702C5BBCF74377BD47457A3D17C58B3D231673BD9F9601BAFB575D3D4E6AAABD4E84B13D3A6B9EBDB387353D1C0292BD97AD683D789B323B54FA3B3D8BB2073DCDCB5BBD4AD656BD6D45B0BD351E96BD2CC8A63DF3E0DF3C42D12DBC81BCB23D2829B73CDBE167BD3B1292BD732F0E3D207BE33CC52E223DFE35E6BB450E233DAC3F9EBD57F799BDE0FCA5B991C28F3DC05EF0BCA18EB23CD4EFA93D1E59A83D2FA9D53CF3F1C0BC56909F3DC096D23C1F0628BD02DDF1BBD33F123DBEB28D3D6DDB913D5B2F8F3AB914933D3CA4EE3C08B591BB8A8E8F3D767EA1BDD9629A3D49CB2EBD1BB050BD1D94623D40A7FD3C96AD803C8F506F3D765696BD3C918E3DC1C49ABDA21D8C3DD1AC14BC8E92FFBC2DDF5C3C7F57913DA804603C2982E63C8E376BBD8E3F7EBD04202DBDA9174B3D35AB2D3DDAEF373D0E4D6B3D642A943DE84D2ABDBD5F453D23A6A23DE3B99FBDE19529BDD52A3ABDD262BDBCA5168CBC39AFCBBCD9F23D3C2A7573BDA27CA63DB549903D5AAF0DBD0CDDEEBCEBFA663B2EFAAD3CB1B798BC997088BA32F3F13C558A2CBDFCEB1A3D1277A73DA1D53ABD9F4E24BD5FF4B53CF3CF923DC9B98FBD5BDB073C9E51153C6C66243DBE8565BB5B5AFCBC0EA7223DFC2EAB3C8CDB7EBD5A9A88BD65534C3DF58B9D3B8BD9ECBC672B733DF2620EBDEBE465BDF9384B3D1B4F2D3DD89B6B3D7726B43D34C1963D1CF8B2BDEF7A4FBDC2F5A6BD90EAACBB283E59BD71AA273B169D3E3B4DDF353D6ECC6C3DB2ABFCBC5E11243DDA4326BC1C7A2A3DC33BA1BDADF5523D7D00283DB8208D3D642915BDE4C3073BEE341ABD634578BDECCC8ABD38893E3D5F35293DCC48EA3CEA367ABDAFC6073DD4DB683D60CCCE3B4E13133D3194953DDE1F52BDF024A8BD83E1A6BDF26D3F3D65C9173D38319D3D4068903D0BCEEE3C9973AA3DC4322DBD0CE309BD311F8DBD8711F3BC69AE1EBD75B9833D36F965BDCD56A2BDD1C52A3D860C0ABD746EA9BDA52F973D391A9C3D61D8363DEE75B4BDF53C98BDAEA4A53DF4205C3D12A4ECBC14D3233C89660EBCA15D0EBD16B09B3DB904B3BD5623063DE07867BD1780ACBD2BEC5CBDD1C8C6BC0315ADBC148F8C3DF56234BD1CEAEDBBC7BF9A3D4F010E3DEBB79A3D1BAA7ABDE1087F3DC68F8D3DA912A6BD5A63D23CC52325BD76EB32BCE40C053D7B09653D36AC89BDB4CF113D523ACD3C27CC683D39A794BDD28490BD1B479C3CBB46823D1FC1153D2198E5BBF5C873BDA6C90D3C245BBB3B438523BD6CF5B7BC258A25BCC4AB92BC639FC6BCC8C2ABBDD3AFE8BBAA88603D6E7388BBC137803DC024173C4F0FBEBBBBDF143D18CD4E3DE67D8CBD9D5937BCCDDFA9BDF7ABB43C0C15B3BC0B9A1DBD384ECFBB3AFE31BD1CFD89BB15D9B2BD871022BDE0E2A1BD8E7295BD1967C33C2044A1BD69C7AA3D06B21EBCEC72683DE80B4FBD1A141DBB44F6AEBDECC98F3D93D21E3DB220B33D07A28ABDDE76F3BA57B7DF3C31BCA8BD756019BD5BAEEE3C953F853C35AD5DBD2770093D50B3293CFA79A43CF6E785BCDC3982BD6C7D4C3D0EF28BBD2B15A0BD6E20883CCF1BB73C0B7DA13C77E2C33CF5A6D83C588B20BBDFEC8FBD45CF183BD3148BBD9E4702BCBBC7E83C5EBE813D92E3993C18BB313D238CD73CE56356BDC36084BD19EC83BDAE32A4BD0FFE09BD079D87BDD8E2A5BC574DA53D8BBEA0BC52C844BCB581643CC02CB0BC0A78B1BD818E87BB1D0B9FBD019483BCD4457CBCE5030EBC6D9F3EBC34D7443DE25E953D2445403D4F373B3DBF31F73C87C702BDE05250BB82E2503C06ECAC3C302DB9BC591F1D3D545C40BC0B0E003C9133693C747DEEBC67CDA03DFAC5D9BB62C00ABD169E8A3DD1194B3DB92143BDC9FBDD3BFB3333BDE3FB653DB85F9CBD27A5B13C03CAE7BCCAAD683C13CCAF3DD2D597BDD664F33AF1C3E23C7A40E43BF501A33D10F7CFBCAEC686BC417C88BD3F220EBDE35695BD08379F3DC8297B3DB17C983C0BC952BD914DB13DC7B852BCEF68F13C64BDD33A537C3ABDC9FE123DCA72E4BC4B6BB3BC645E3F3C50BE563D4C1F823DE00F0B3D1AB58E3D680DB13D26C4413D26D6A93DAD61963C4B0D5F3DB6E11EBDF4C360BD61D9373CC587B8BC6C70B2BDF2C6803DD214233C811F88BD9851F2BCEF67C83C8F187DBD04C1073DFBBA0A3D8A2507BC446C903D5E5024BA38FD123DA29E9B3D020E013DD130893D608D5D3DEC9D6DBC6D4C9B3DBD8472BD8494CE3B6E16ACBD1A96053D377B28BCED53F4BB9EC61E3C442CCD3CE1F55E3C53D105BDFF14A0BD2E7660BD375615BCC10D1C3DEA19433D1559A83D5D6C9A3DF5498EBDE2E575BD29AA2EBD148A90BCB84552BDF074B43DBA719D3C8088D13C31FA643DDB92533D6642863DA3E98A3B",
      torch_tensor_128_torch.float32: "0x04000000411FE0BBDC180A3C6E21B43A384DEC3C0599BA3CE35C93BCAACF75BC7554D13C9C9E003D3760C03CCA51F93B45EC633CD3934CBC2A629F3C0C0CB7BC13D9A4BC8C700FBD93DB9CBB3A8EFB3C77DE073CC5ECA5BC01FD6E3BC114D7BCDC9B3F3BAA1C683C0CEFCF3C25F75BBC9C8183BC6AB5F63C5E03F73C05E2D03CC5FE673C838E103D1A15B4BC9437043D3A36B73CC159E7BCCC5C0E3DA0460ABD1ED9D43C2E23ED3CDA08DCBCB7F003BDDC68EABA2518703B9C20F83C8749B7BC1C34DB3C7167EDBC47C3B1BCFA499F3C93552D3BDC967D38F36016BC6E1B923A232EFDBC2EDDF93B2A980BBDDCE9023D5524E7BCEE19D23C474708BDDCB534BB63AED03C7310EF3CEE69263B86EB113DDC87BABCAC6492BC7E4EFEBC3C975C3C5CBE01BB1336E4BB658210BDB769B9BC5C5167BC0A78CF3BA3A3B9BCCEBF0D3DF16EFBBC4A73C2BCD5FCAFBC4A3EB23CE11AC6BCFAEEE6BC02A4113D21A86ABC93B50DBDCA41103BAC15EABCBA9BB13CACB8EEBCAC9FDC3CF792BB3BFE88D0BC2E26963CE37CC73CE771CC3C7368943C77FD97BB673FBE3C0572503CBE8CEABCEA0C4F3C7790A4BC18F8F4BCB8456D3C2A0C263C7CC5BCBC2577B6BBCE35113DEE09133C5C09893B6E1884BADA8608BDAA77BFBC07C0C3BC15FFB5BCF53BA53C38A3EB3B8556B2BCE1B8C7BC5C2566BCAACF4DBCA084983CAC5A8FBC7A72883C01EA303B",
      torch_tensor_128_784_torch.float32: 