module {
  func.func @main(%arg0: tensor<10x784xf32>) -> tensor<10x10xf32> {
    %0 = "tosa.const"() <{value = dense_resource<torch_tensor_10_torch.float32> : tensor<10xf32>}> : () -> tensor<10xf32>
    %1 = "tosa.const"() <{value = dense_resource<torch_tensor_10_128_torch.float32> : tensor<10x128xf32>}> : () -> tensor<10x128xf32>
    %2 = "tosa.const"() <{value = dense_resource<torch_tensor_128_torch.float32> : tensor<128xf32>}> : () -> tensor<128xf32>
    %3 = "tosa.const"() <{value = dense_resource<torch_tensor_128_784_torch.float32> : tensor<128x784xf32>}> : () -> tensor<128x784xf32>
    %4 = "tosa.const"() <{value = dense<[1, 0]> : tensor<2xi32>}> : () -> tensor<2xi32>

    %5 = tosa.transpose %3, %4 : (tensor<128x784xf32>, tensor<2xi32>) -> tensor<784x128xf32>
    %6 = tosa.reshape %arg0 {new_shape = array<i64: 1, 10, 784>} : (tensor<10x784xf32>) -> tensor<1x10x784xf32>
    %7 = tosa.reshape %5 {new_shape = array<i64: 1, 784, 128>} : (tensor<784x128xf32>) -> tensor<1x784x128xf32>
    %8 = tosa.matmul %6, %7 : (tensor<1x10x784xf32>, tensor<1x784x128xf32>) -> tensor<1x10x128xf32>

    %9 = tosa.reshape %8 {new_shape = array<i64: 10, 128>} : (tensor<1x10x128xf32>) -> tensor<10x128xf32>
    %10 = tosa.reshape %2 {new_shape = array<i64: 1, 128>} : (tensor<128xf32>) -> tensor<1x128xf32>
    %11 = tosa.add %9, %10 : (tensor<10x128xf32>, tensor<1x128xf32>) -> tensor<10x128xf32>

    %12 = tosa.clamp %11 {max_fp = 3.40282347E+38 : f32, max_int = 2147483647 : i64, min_fp = 0.000000e+00 : f32, min_int = 0 : i64} : (tensor<10x128xf32>) -> tensor<10x128xf32>

    %13 = tosa.transpose %1, %4 : (tensor<10x128xf32>, tensor<2xi32>) -> tensor<128x10xf32>
    %14 = tosa.reshape %12 {new_shape = array<i64: 1, 10, 128>} : (tensor<10x128xf32>) -> tensor<1x10x128xf32>
    %15 = tosa.reshape %13 {new_shape = array<i64: 1, 128, 10>} : (tensor<128x10xf32>) -> tensor<1x128x10xf32>
    %16 = tosa.matmul %14, %15 : (tensor<1x10x128xf32>, tensor<1x128x10xf32>) -> tensor<1x10x10xf32>

    %17 = tosa.reshape %16 {new_shape = array<i64: 10, 10>} : (tensor<1x10x10xf32>) -> tensor<10x10xf32>
    %18 = tosa.reshape %0 {new_shape = array<i64: 1, 10>} : (tensor<10xf32>) -> tensor<1x10xf32>
    %19 = tosa.add %17, %18 : (tensor<10x10xf32>, tensor<1x10xf32>) -> tensor<10x10xf32>

    %20 = tosa.reduce_max %19 {axis = 1 : i32} : (tensor<10x10xf32>) -> tensor<10x1xf32>
    %21 = tosa.sub %19, %20 : (tensor<10x10xf32>, tensor<10x1xf32>) -> tensor<10x10xf32>
    %22 = tosa.exp %21 : (tensor<10x10xf32>) -> tensor<10x10xf32>
    %23 = tosa.reduce_sum %22 {axis = 1 : i32} : (tensor<10x10xf32>) -> tensor<10x1xf32>
    %24 = tosa.reciprocal %23 : (tensor<10x1xf32>) -> tensor<10x1xf32>
    %25 = tosa.mul %22, %24 {shift = 0 : i8} : (tensor<10x10xf32>, tensor<10x1xf32>) -> tensor<10x10xf32>

    return %25 : tensor<10x10xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_10_torch.float32: "0x04000000B22D6CBD9CF1A93D786CCFBC73E5083C914EFABC60241DBD11773EBDD33C88BD46F4FABC4F13A2BD",
      torch_tensor_10_128_torch.float32: "0x04000000F0E2133C4B4B5BBD11733C3AE61F4CBD50D183BDDBDEB33D1EF00FBD3C5211BD6AAD983C20EFF6BC842880BB967B16BDB80FC43C234FF3BC9542863C27C1D6BC3AC0B13D8429913DE0D8963D4F6371BDA7C8723D0D06A63D5654AEBCEBD3A63DC39B9EBDADE9B03D5BA67DBD8DFB6ABD3E82823D677C03BD03FE8DBD80DD223DA594F0BA0A45AFBC8EA280BD12740CBCC712473B026337BD70A568BC09F74EBDEF19FE3C2D7E193DB379933D398AE6BB8E3D6F3D6DC9763DBB73A9BD15A39FBD352A80BDA023473D9DAB62BC77ED22BD13739D3DE3179B3D1A5DD13CCC5833BB635009BDC3AEAD3C6F91A4BD8484A7BD55D985BC0B8729BD2FD0963C33FD653D785BD93B5B5A17BC12CF073C51EAA0BD773315BD805002BDAFA7B03D6DD801BC6601603D030652BD45BD64BDDA147ABDA8581F3D4487443C4A6EE33CE35951BD509CE8BC87F07A3DF348183D110D62BD66665DBD95AD8EBDB6B4203D8B7A003C1414003D26CE4FBDD31A0D3DF635A03B08667B39E3B6113C0B5B563D4265EA3B3BDD1F3DBD2280BDE271A03DDC52803DA972DBBBCCB0703DE791933DDEF58E3D3655B4BCC46BA13D92CCA8BD5A1295BC3E9181BDEC1CB03D7B669DBCF049353CD648A1BDF8F435BCEAC3543D36AD67BD18C3E8BCA60E833DBC47BC3C5D90973B63E3B83C8A420A3DC8F6A3BD417894BD67A1233C4801133D30A3DBBC637E6B3DFF861BBDF25509BD8543933D0410363C751C993DC0CF493D3349843B8C911DBD65B2A43D41388BBD223D04BCA65625BD194AA23D515212BC5BB1833DFD3C613D1BA62CBD382794BDA762113CAA9880BDC7D6AF3D62364EBD8BF38E3D8385FC3C6AD482BD9357893D70245B3C42A261BD081B663CEBDD7F3D432927BC3F60E1BCD5B53C3D416BB2BC0FDB873D6BF34FBB808C0E3DC464823DB1D13F3DE4274B3D5FC7FA3C3A38803CB5E56EBC66BF3ABDF5C5FABC1FEB07BD39558ABD92A301BD700201BCB6D9C4BCC581B4BDA500C13BA391F1BC9EBAA73D4348903D1F12063CCE62813D646B97BD989FBCBC47CC613D4515B4BDADD878BD8B9B673D1420C73C9B3AB8BAB3818EBD7F62993DCD0636BD81722BBD56E191BC85E7FBBB0AF289BCB61B91BD495A3ABC950B00BD440C7A3D485F613D3665813C62B42C3DCBD96DBD5EF97EBD2DCC89BDBA70073D4E24ADBC162463BD53EA27BDF1AAA03C2E0B6E3DE6D1373D4F57B33D13BE83BD31949B3DC14386BAAC2510BD7BFFE43B2FFBE2BC119834BD5F58C93CCBD9B43C0BC37ABBD683B03CCDD5173D776532BDF792513DBC2E5D3D04E05E3DE215C9BC278E023CFF8A933D5DD9F53CE71771BCCDF38A3BC5A0763CB472293C515E2B3A09D1943C2E26013D30A6143DB5ED9A3D8603AF3D59DC8C3DC2F79BBD52E586BD7338D03B0405A13DABBD793D01AD21BDF78071BD650882BDE7AF2BBCEEDB97BDBD5D3BBDACE2653D98590DBD88DAFE3C822686BD7220ADBD605F6FBDBF09C13CB3DCA53C8A69FCBA71FF8DBDDA240E3D12B9FB3C22B605BD0297F53CAEED45BD59CBA2BDF891033CD89C5D3DB47FA0BDE04597BCC93A253D29D1E53C30F70B3D2CD4E43B65CCA63DE225513DE688A33CE135E63CEA6C2B3DF9679FBD2218653DEA27D13C79A7B43DBCCA843C0A968FBD4753AEBB4EECD73BC5DAC03C4082B33B17C0133D4C56643DFB072CBDD4AB043D18EE1CBDA32811BDCDF79DBD46C9A43D88F212BDF12D2CBC6DEF9F3DFD89D83C654647BC250F643D74C70EBDA0139BBC00609C3DB51A98BD378932BC372818BCB1F8283DEE73EA3CDA6A3FBB18C7A43C37E1653DA205B23DA28C3E3DF551743D0266D53AB0AAAB3A0147B43D3F7B8D3CB5268B3DF3EDA43DF9FF723D3557DD3CB9532D3DF3DC96BD826A8B39E7FE503DB8811E3CDC5C3A3D8E54463DE1CB913DFC3410BCE2302EBDC166653D0780B1BD42CC303D1EE115BD1C7710BD48520A3D391E923D154CE7BCF45349BC1D07FDBCF777B33DB73F073DDAD2113D4AE097BDF6DD97BDF8A6823C9737AE3C529B0FBCB7994D3DEA860DBBA8E9943DCE789C3D05D27D3D1C2CAABDDAA1AE3D64ADD33C13D9343D6E8E883C7DAEA23DF490993D721539BD2B9784BD6EE0E53B13B03ABD2383AABD29E07B3DBECD603CC0A78BBD4324903DB32776BDBA806EBB0F547C3C2A26673DCEF42A3D507C4DBD8EAE1A3C4BEA01BD7557643CEFB02CBD159AA03D1782B13D53D460BC6EC0183D6F6D333D95BECB3BF5A091BDD8B360BB6D906CBDE3A549BDEBD2823C7FC10CBD6139813D18B85ABD928BB4BC200305BD6E9731BAE52A8ABD869A8BBD2F7111BDF23BA1BBA00666BD5EEF7A3D2EF3913D7F573FBC9FD17739D63B3A3D84D8703D675088BC33E42C3CF91DD9BC4997B13DC99A0CBD927A55BDA859123D539C07BD35B326BDB2B89A3C691D74BDBA7E0D3D2EC8E73C2F97A53C26AF0E3D2F739DBDA9B981BD55CD75BD0AD7AD3D7E4024BDF005903CC47C923CBDBF003DBD5F813D31C95BBD1F319DBD5212A73DAADC9B3CFE11E23C87B08A3D9734873D6638F3BCDBD4F5BABB898ABDEE8E813BF03D0B3D99449DBD8248A53DFCD33C3D319DACBD3287B4BCE29F593BE0BE96BDFB657ABDF52E24BD842F8DBD0EAABA3C3CC7AB3CD88627BD986029BD0D2D23BDC557A13DF4EB0B3C32FAA6BB7D26773D4D3719BD0DC40EBDCF4575BD32D4813D354F8E3D824C513D3C7D9A3D4C7E8F3D22B3AE3DB230B23B30D23D3D091E86BD9F1FB13DF89983BCF371A6BD4987403C60A627BB36C1A8BDA31B713D9246A0BD1C3BB13CF7D22CBCE34AA0BC1DC81BBCD9689D3DFF54743D5CE4163D4CFCD4BB3135983D99D30E3DAC4B9E3BCA4391BD7B80D93C0ABC7E3D263B213DCEA357BD4D3D833D7389B8BBFFD6023DFDB217BD633430BD3E2081BD505F313DF848A2BD41DB0E3C38D0B43D1B06913DF9A3AABC75D9B13D9C7353BDED5A29BC1437633D03E2A83C1EC7E33B942F973CE26EA53D448652BA7565D9BB4E44C1BCB2D13A3D364277BC4D362BBD0E77903D0ABD423DC2BF203DE549E7BCF0438DBD09571DBD501056BD0CA0143DEF8DB03CFDCADABCC75EE73CBDA6083D37048DBD60A1C6BCD35241BD10A3463DE3C93EBDDD5C46BD16193A3DCA9E203D7E98A2BD751926BDE20887BC5032B1BD832756BD20C4933D5BA771BAE061A6BD0A9DA13DC950C23B8BBD8C3C5B220C3C8EC27A3D9762AD3DA21D7A3D5EBA5F3D0B408FBDC9D020BDCD5E45BDA77D80BD09C129BDD185033D4C3F3B3D52567D3D29F66CBC823F20BD5EAF873D69D6393C732AA8BD9299163D475F513D0857AA3DD48C6D3D17150BBDE332ACBD70C45CBD544EC3BC64FDF33BABEF003D1330883B65174FBD5EBFB43DA83323BD8549963D9ECEDDBBDC3817BB16061E3DE208CABB6462B1BD80AA6CBD77FD5F3D7426543DE1A6283CD5909B3D357F253D39DB463DB3C933BD5C2C24BD3DA23DBD5C2BCD3CEB3137BDBA6E0B3DBA363FBD7189423DA10CA6BD638B8BBBFE671B3C6659A4BD32D6AFBCBBC295BD317C4D3D204A50BD87DC35BD006BABBD31759B3DFC09793B3AFD913D502E2D3C97FD9D3DD1A961BD6A2D063D02D5193DE1BE983DFA9D5ABDE1A6A5BD1E60E43CAF22413D5B770D3C43AB55BCDBFAFB3CF020A43D909F933D9B54623D55A0843D2544F93AFB0F75BDE6DBB3BC227A88BDE17F883DD9CA993DCBC79B3DE17A703C902F40BCC50210BDFDE6D53CB333083DF820943DB1811F3C2DF7CABC65F663BD3878653C22EB5BBB5A191FBBC9B36F3C9B4E66BCD4FFF6BCCE5924BD4D2924BCB19AA2BCAB5E983D08897DBDB96D1C3D7ED6843D7FD09ABC6A84D9BCB2C5453D035E723DB323ACBD650DA3BD21496A3D06E32FBDC23D843D1D6CAF3DD203B1BD43DF363D2BEC34BD44E058BDCEE8283DAD43993CB46B9ABD38B047BD43357B3DD0BF9E3C7F2B89BDFABA613CCE111DBDA2F7A33D3B2B2BBBB0D79E3D34EBAC3D8A20D4BCC1BA3F3D7EADBC3C22E7B23DADF5E3BC0470083D50DA7E3CB571B43DB677B3BD273996BCB5AF82BD94CE9D3C8F87083D4B1D32BDE6A631BD2B5794BC75D7093AC035833DC804D5BAF90F983C796795BD8A5CACBD487963BD1476AEBDF946D73CFC6B7D3DD36D9BBD29021DBDD1AF843D5A15DE3C19909B3C919B1BBB333801BD8810543D99838B3DB9BC083DA4FEC7BC365E783D7F6AAF3BEB50AC3D46E8A1BD7D0AABBDBCE550BCB280AC3DAFD4B1BB2E22CBBC42A45F3D9F71B03D3A5488BBE1C9133D9BB3743C5C454FBDFC58313C6570B43D91583D3D1AD4FA3C2808393D8B858B3D81E53D3D3BD93ABD1E7AADBDB2E2B9BCA8C47EBC2164ABBD9FBFDCBC6ABB643DB1E02BBC07098BBD045FB13D55DE3BBDA7B012BD7C8676BDFF36E03C60415FBD27D053BD5F8BD63B14259ABD062DE93CC0F8413B782809BD1C1E7A3D2511E4BC88FB9F3D44517EBB7863A4BD27FF9ABD9BD4963C3F67643DF686B2BD9901B53D4B77413D9EC1E33C490E203D6E6407BBFA0A36BD8F1694BC574961BDE53EB8BC0954313D274BAA3DA7D2F83C355F99BDFE405EBD771EC7BC0468A4BDE3388D3C6CDE9D3DC3F4823DB3DF8CBD7C6D88BCB8B6AE3D3648A0BC50A2B13D6F4D92BC4F7575BD8AF44CBD52D701BDC338A6BDDA35393D1EA1253DDAE4D8BCE98AAEBDF015403D1460B53C4DEEB33DE976F3BCB0C94D3D2704AEBDA26847BD90B4573D06179C3D08E7973D51A1423DB2FE993D9B2C763DF3C1133D0EAD83BDF0B150BD10D8AC3D4E15503DBD7771BD720A5EBDF5888F3DFB10B43DF6EF44BDCBFB95BDE97537BD3254EFBC60C06A3D249863BD2D4CAEBD27C02DBD38A97FBD5E66AABDD7C84E392655403DA78B4A3CD0B6473DBB0474BC39C265BD48E556BD48C5B53BF6F703BD2CABAF3D83E8A33C7E591A3D37C48E3DBFC24BBD84C5A0BDCE056F3DAA10813DAADE84B9FBC055BD47FB3DBD348E313DB2E9E8BCE3B59F3D988F383CBBE5B03DC405683C624A98BD56B0A4BDBD88D23ABB330FBD4AEFB3BD538297BD170E9DBCD0F8AFBD1AE4603B0AC2253D601755BD35A51E3DA7A126BD5D4D2C3DD3A0A23DFB1338BCE1289ABD3A7117BD8577BEBB6C53B83C9579543DEC83EF3CC36033BDFCEBEE3CB630143D8E9CA5BC544189BDD0E5963D8A1EA43C3D419BBD91EADE3C9A341EBD201E8DBD28E883BD778682BD8AE73ABD6A94FFBB98657A3D27E98EBC8F101ABCE4FE7ABDE96D1A3D876B99BD9B6B473C5E7899BDC213E73B92DE2FBDE8F436BDFAE8793DB6AD8C3D32FC56BCB05CD0BB6AABA2BD77D8FC3B4E50AE3DC5A5833C393F9E3D59B948BD1B59EA3C4BCEA7BDFD58A8BC7120A83BA822A7BDBAF4AEBD3FDEC3BC29B219BD334DB03D5DACBC3C881B98BCB248A33D99AA333C1DA30ABD3C64FC3B9FE3F43C1000603B9B042BBD07AF27BD5C77FA3C730429BD352B85BBC425EBBA386297BD5BB130BC2C75393DCAA51F3D3A0E85BDA64FD93CAECBC4BBE1F070BDF82EADBD46FDFDBC9F27BDBC90D4CCBA62652ABDF0C870BDDE8087BD209A40BDDA0577BD5037563B9D8D063D2BFE863DA12180BDF3FA6F3D2F5638BCD56566BD8AE2B03D6FDB613D608D9D3DFF8A513DD9E1FE3C8397AB3D91E6A73C2C75833D93A9813DCBABA6BC154619BD8379A4BD8895A03C3347B03A124951BDBA2DAF3C700891BD8D8C3BB914F1B4BD6E2DA0BD318917BD0CB3213D9699883D263ACC3BC5F6F6BBDA803FBD2601DFBB0379E23C6DDD923DA49E8ABC3F7F923D475A913C3E19013C7BC6B03C4B0B22BD5B0D573D5DED6A3D2E3B7C3D866FA1BD6627AFBDBE8E32BDC58575BD28EAF5BC839857BB06B0AABDD6D7E9BC99FDCC3C5B6296BD67941CBDA0AA86BD7167273CC915A93DCD4A65BD11A94E3DDAA03C3C5FA29BBDB8C613BDA7EE30BCB70A46BC821AA8BD35ED21BDE9D4213D0C146D3D61E0DE3CE9118FBD756C5E3D0E8F863D16B35F3DE7828DBDB4141CBCE63B2E3C1DC085BDEF65A03C5950D23B2B8B613DA418863D4E5368BDA324283D1C49FABC5CB2BB3C03B19D3D7165883D30B43E3DE5DA50BDEDC943BD2911E13CF60459BDB984A7BDD52C89BD7BA3A4BDC0826B3ABE9C933D48B276BDDF24A83DFC1C843D969C773B23FEAF3D3F6B833DF895273D175472BD49AD94BDDE04753DD80CDABCBCA278BDDA6882BCE62F963D1756B5BC2A7EB3BCDDB47D3DC10617BD8225D5BCB24DA6BD3BA561BC57EA70BC3410513A2E71353CEBE8B43DA217EEBBC06F473DD1C2FF3BAA1B443D896B2FBD6ACCB03D6C4EA63DA9A3AB3C2FECC03CC620C9BB2C879EBDD3EAE8BC154295BD12918ABD01981CBBAD46813D727963BD0AFC0DBDAB5F5BBDCE4B8DBD3A0309BDD706913CE92AECBC55AD393DB2F333BD7B11D6BA85E0FA3CA9B913BB55EBA2BD185179BC9DA7923DDF423CBD87CD69BDFEE470BD6479B7BCBE4B4DBDB12E0FBD1B8D233D23C19B3D224CAD3D938A173C919F06BD185452BD4BD6553D1997573A949385BD273F223D6F0CC33B7FAA363D4709F5BC78785E3D2E7C71BDDD18EB3CF37BAB3DB40B9CBD512B2B3DBFF5C9BC22321DBDA03C7C3DE6DA8D3D900E20BD59CFCC3BD7C88E3DE51F82BD8C6BBDBC595BB1BC64054ABCC489973DFC5790BCB36299BAB3E5883D56334B3D550F42BD8F3FA73DCB77DEBAF997463D3B931E3D79A555BB8362FCBCDFC68B3DA7C9273D2C6A143C917B9BBDE9B2783D1DCB103D4D944D3DF0DD8CBD0DC1873DD78346BDF2E5803DE27FA73CC24B81BC9AAC56BC6CA36D3D948711BD2D942A3D22AEEABC5834A63D68A9A43D41B1653D4A40443CF3EB8FBDE6CC3DBD31ACC8BB3757703CD95A963D8D0F93BDB30C1DBDD7E298BD7BA7923A4EE0AB3D49DD123D23A16B3DDF75A83D1B43823D3C6469BD74A74CBD64A29A3DD7F4B8BB6C49D8BCD356AFBD7E8A593B6DBC5EBD1B9A48BDCE8CE73C2EC757BBECD7A83DD4F2543DF6C9A5BCFA05E1BC02EF4D3C72C3A5BCD3DDBFBC8647CB3BDBB03F3C6DE246BC25E1D33CC718213D1A771C3D51E39FBD44B027BD7D0C173DCFD199BDCBB391BC7534F0BCAEE09B3D84AC2CBD4BD53FBD53444A3D3B128E3DE3B4BDBC9F4C763D739F593DB3A89ABCD7BB433DB08816BD5BF1223D633F0DBD3CE9B13DDEB6AE3DA6942ABDB63BC1BC10CE92BDDB80853CAB4B773CCB5782BC92F1A73D80068DBD2EFB0FBD",
      torch_tensor_128_torch.float32: "0x04000000D7680FBDCA36903C2523DB3C57ACD8BCC1C3CABCB802043D55F3D6BC85518B3C611434BC139AD4BC1E45993C0070A5B980D8113D13E88E3C5171D4BC139E29BB4A734B3B3130E13CBE13EF3C8A29E9BCF8F765BC1CEE033D25AEE63BAA3E993C3C5F05BD0074A63C3760CF3BEC80AABC57C7CD3CBECDBCBC0251063D6E008DBC509DA23CCE8015BC038D8A3C33B6AEBC430410BD95D891BC0AC0E43BC74004BD0068043C03D8DDBCBC3F683C8F700B3DB3014ABCEEC2043CCA4AE8BC4C65CE3C9C13663C733C4B3CB8365CBBB559E23CA18A46BC2C8D80BCEEE72DBBD7C0583C13A073BC1C6D963B65C0563CDCB56DBC6AAFE33CE5CC9DBC7355303C4A6A77BC77079CBC2725003DE5BE87BB8825ED3CEAD90DBD632CEDBC6584973BA55E8BBC7CB544BC1E840D3D0E75D1BC2EDA0D3CDE96D03C27AA07BDC5C374BCFC75523CB333AA3C93F48E3C6E33DB3CC56EF13C6029A2BC1A8CB13C258B86BC5329833C0C75CBBC3A97C73C9C44FEBB9C3A93BB587DE83C319DE0BC374A57BBE5AC863C57B7313CF758173CDC2DE5BC4A9C223C8597213CC2D40FBD80A010BCAAB37EBC9E5EE2BC65E189BB41E3BD3B7E5FEF3C92C503BD0154D3B913E23E3B4A25553B6EE79BBA67A8C7BCD5660FBD5C26B3BBEF7A0C3D1C3E203C335999BC37D59DBB93FB12BB98C47E3C6532FCBC374E86BB61D9C03CE1C0D43C9C7394BCEE26D43C",
      torch_tensor_128_784_torch.float32: 