module {
  func.func @main(%arg0: tensor<10x784xf32>) -> tensor<10x128xf32> {
    %cst = arith.constant dense_resource<torch_tensor_128_784_torch.float32> : tensor<128x784xf32>
    %cst_0 = arith.constant 0.000000e+00 : f32
    %0 = tensor.empty() : tensor<784x128xf32>
    %transposed = linalg.transpose ins(%cst : tensor<128x784xf32>) outs(%0 : tensor<784x128xf32>) permutation = [1, 0] 
    %1 = tensor.empty() : tensor<10x128xf32>
    %2 = linalg.fill ins(%cst_0 : f32) outs(%1 : tensor<10x128xf32>) -> tensor<10x128xf32>
    %3 = linalg.matmul
        ins(%arg0, %transposed : tensor<10x784xf32>, tensor<784x128xf32>)
        outs(%2 : tensor<10x128xf32>) -> tensor<10x128xf32>
    return %3 : tensor<10x128xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_128_784_torch.float32: 