// Generated by ./build/lib/ToyNPU/toynpu-opt --transpose-folder examples/00_input.mlir
module {
  func.func @main(%arg0: tensor<10x784xf32>) -> tensor<10x128xf32> {
    %cst = arith.constant 0.000000e+00 : f32
    %cst_0 = arith.constant dense_resource<torch_tensor_128_784_torch.float32_transposed> : tensor<784x128xf32>
    %0 = tensor.empty() : tensor<10x128xf32>
    %1 = linalg.fill ins(%cst : f32) outs(%0 : tensor<10x128xf32>) -> tensor<10x128xf32>
    %2 = linalg.matmul ins(%arg0, %cst_0 : tensor<10x784xf32>, tensor<784x128xf32>) outs(%1 : tensor<10x128xf32>) -> tensor<10x128xf32>
    return %2 : tensor<10x128xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_128_784_torch.float32_transposed: 